In [11]:
# mpg.csv 데이터를 데이터 프레임 mpg로 읽어 들임
import pandas as pd
mpg = pd.read_csv('C:/Users/213/Data/mpg.csv')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [15]:
mpg.groupby(['manufacturer','drv']).agg(mean_cty = ('cty','mean'))

                   mean_cty
manufacturer drv
audi         4    16.818182
             f    18.857143
chevrolet    4    12.500000
             f    18.800000
             r    14.100000
dodge        4    12.000000
             f    15.818182
ford         4    13.307692
             r    14.750000
honda        f    24.444444
hyundai      f    18.642857
jeep         4    13.500000
land rover   4    11.500000
lincoln      r    11.333333
mercury      4    13.250000
nissan       4    13.750000
             f    20.000000
pontiac      f    17.000000
subaru       4    19.285714
toyota       4    14.933333
             f    21.368421
volkswagen   f    20.925926

In [17]:
mpg.query('manufacturer =="audi"')\
        .groupby(['drv'])\
        .agg( n = ('drv','count'))

      n
drv
4    11
f     7

In [19]:
#1. suv 추출 : query()
mpg_suv = mpg.query('category == "suv"')
mpg_suv.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
18,chevrolet,c1500 suburban 2wd,5.3,2008,8,auto(l4),r,14,20,r,suv
19,chevrolet,c1500 suburban 2wd,5.3,2008,8,auto(l4),r,11,15,e,suv
20,chevrolet,c1500 suburban 2wd,5.3,2008,8,auto(l4),r,14,20,r,suv
21,chevrolet,c1500 suburban 2wd,5.7,1999,8,auto(l4),r,13,17,r,suv
22,chevrolet,c1500 suburban 2wd,6.0,2008,8,auto(l4),r,12,17,r,suv

In [30]:
# 2.합산 연비 변수 만들기 : assign()
mpg_suv = mpg_suv.assign(total = (mpg['hwy']+mpg['cty']) / 2)

In [29]:
#3. 합산 연비 평균 구하기 : agg()
mpg_suv = mpg_suv.groupby('manufacturer').agg(mean_tot = ('total','mean'))
mpg_suv.head(5)

              mean_tot
manufacturer
chevrolet          NaN
dodge              NaN
ford               NaN
jeep               NaN
land rover         NaN

In [39]:
#4.내림차순 정렬하기 : sort_values()
mpg_suv = mpg_suv.sort_values('mean_tot',ascending = False)
mpg_suv.head(5)

              mean_tot  total
manufacturer
chevrolet          NaN    NaN
dodge              NaN    NaN
ford               NaN    NaN
jeep               NaN    NaN
land rover         NaN    NaN

In [45]:
#5.상의 cell의 (1) ~ (6)까지 의 작업을 하나의 구문으로 
mpg.query('category == "suv"').assign(total = (mpg['hwy'] + mpg['cty'])/ 2)\
            .groupby('manufacturer').agg(mean_tot=('total','mean'))\
            .sort_values('mean_tot',ascending=False).head(5)

               mean_tot
manufacturer
subaru        21.916667
toyota        16.312500
nissan        15.875000
mercury       15.625000
jeep          15.562500

In [47]:
#데이터 합치기(merge(),concat())
#Lab 6 : 가로로 합치기
#중간고사 점수를 갖는 데이터 프레임 생성
test1 = pd.DataFrame({'id':[1,2,3,4,5,6],
                      'midterm':[60,80,70,90,85,66]})
test1

   id  midterm
0   1       60
1   2       80
2   3       70
3   4       90
4   5       85
5   6       66

In [50]:
# 데이터 프레임 test1과 test2를 가로로 합치기 (how = 'left')
test2 = pd.DataFrame( {'id' : [1, 2, 3, 4, 5, 7],
                        'finalterm' : [70, 83, 65, 95, 80, 77]
})
total = pd.merge(test1,test2, how= 'right', on = 'id')
total

   id  midterm  finalterm
0   1     60.0         70
1   2     80.0         83
2   3     70.0         65
3   4     90.0         95
4   5     85.0         80
5   7      NaN         77

In [52]:
#Lab 7 : 세로로 합치기 (concat())
# 첫번째 시험 결과 데이터 프레임으로 생성
group_a = pd.DataFrame({'id' : [1, 2, 3, 4, 5],
'test' : [60, 80, 70, 90, 85]
})

# 두번째 시험 결과 데이터 프레임으로 생성
group_b = pd.DataFrame({'id' : [6, 7, 8, 9, 10],
'test' : [70, 83, 65, 95, 80]
})

In [57]:
# 첫번째와 두번째 시험 결과 데이터 프레임을 세로로 합치기
group_all = pd.concat([group_a, group_b])
group_all

   id  test
0   1    60
1   2    80
2   3    70
3   4    90
4   5    85
0   6    70
1   7    83
2   8    65
3   9    95
4  10    80

In [58]:
group_all= pd.concat([group_a, group_b],ignore_index=True)
group_all

   id  test
0   1    60
1   2    80
2   3    70
3   4    90
4   5    85
5   6    70
6   7    83
7   8    65
8   9    95
9  10    80

In [59]:
       함수                                    기능
query()                                       행 추출
df[]                             열 추출
sort_values('math')                           정렬
groupby('category').agg(새로운변수)        집단별로 나누기
exam.assign(newcolumns = exam['math']+1)   변수추출하기 => 새로운 컬럼 추가
agg()                                      집단별 통계치 구하기
mearge()                                   데이터 합치기(열)
concat()                                   데이터 합치기(행)

SyntaxError: invalid syntax (1667464363.py, line 1)

In [61]:
#7-1 결측치(빠진 데이터 찾아 정제)
#Lab 1 : 결측치 찾기

import numpy as np
import pandas as pd

In [62]:
# 결측치가 들어있는 데이터 프레임 만들기
# NaN : Not a Number 숫자 형태의 누락된 데이터
df = pd.DataFrame( {'gender' : ['M', 'F', np.nan, 'M', 'F'],
                     'score' : [5, 4, 3, 4, np.nan]} )
df

  gender  score
0      M    5.0
1      F    4.0
2    NaN    3.0
3      M    4.0
4      F    NaN

In [63]:
# NaN 값으로 연산된 결과 값도 NaN
df['score']+1

0    6.0
1    5.0
2    4.0
3    5.0
4    NaN
Name: score, dtype: float64

In [65]:
# 결측치 확인하기
# na : Not Avaiable
pd.isna(df)

   gender  score
0   False  False
1   False  False
2    True  False
3   False  False
4   False   True

In [66]:
pd.isna(df).sum()

gender    1
score     1
dtype: int64

In [67]:
# 컬럼(변수) score의 결측치 개수
pd.isna(df)['score'].sum()

1

In [68]:
#Lab 2 : 결측치 제거
df

  gender  score
0      M    5.0
1      F    4.0
2    NaN    3.0
3      M    4.0
4      F    NaN

In [70]:
df.query

<bound method DataFrame.query of   gender  score
0      M    5.0
1      F    4.0
2    NaN    3.0
3      M    4.0
4      F    NaN>

In [73]:
# score 변수에서 결측치가 있는 행을 제거
df.dropna(subset = ['score'])

  gender  score
0      M    5.0
1      F    4.0
2    NaN    3.0
3      M    4.0

In [76]:
df_nomiss = df.dropna(subset = ['gender','score'])
df_nomiss

  gender  score
0      M    5.0
1      F    4.0
3      M    4.0